% 1. Задание значений функции  

>> A=1; % амплитуда импульса
>> Q=2; % скважность 
>> tau=pi; % длительность импульса
>> Tu=Q*tau; % период следования импульсов
>> r=find(y==1);

>> w0 = 2*pi/Tu;
>> t=linspace(0,Tu,10000);
>> y = A*0.5*impulse(tau,Tu,t-Tu/4)+0.5;
M=[100 200 300 400 500 600 700 800];

% 2. Вычисление погрешности приближения к функции   усеченного ряда Фурье и интерполяционного тригонометрического полинома от числа вычисленных коэффициентов ряда  . 
>> for m=1:length(M)
>> T=Tu/(2*M(m)); %  период дискретизации
>> tk = 0:T:Tu; % задаем ВС
>> xk = A*0.5*impulse(tau,Tu,tk-Tu/4)+0.5;
>> c0 = 0.5; % нулевой член ряда
>> z1 = c0*ones(1,length(t)); 
>> for n=1:M(m), % вычисление коэффициентов ряда Фурье 
                 % по аналитическим формулам
>> cn(n) = - 1i*(exp(-i*0.5*pi*n)-exp(-i*3/2*pi*n))/(2*pi*n);
>> c_n = conj(cn(n)); 
>> z1 = z1 + cn(n)*exp(1i*n*w0*t) + c_n*exp(-1i*n*w0*t); 
>> end
>> [z2,a1,b1]=trigonometric_interp(tk,xk,t);
>> a1(1)=[]; b1(1)=[];
>> An=sqrt(a1.^2+b1.^2);
>> RMSE_1(m)=sqrt(sum((y-z1).^2)/length(y));
>> RMSE_2(m)=sqrt(sum((y-z2).^2)/length(y));
>> E(1,m)=1/M(m)*sum((real(cn)-0.5*An).^2);
>> E(2,m)=1/M(m)*sum(cn.^2);
>> MAX(1,m)=max(z1(r)-y(r)); % усеченный ряд Фурье
>> MAX(2,m)=max(z2(r)-y(r)); % интерп. тригоном. полином
>> end

% 3.	Построение графиков зависимостей     

>> figure('color','w'),
>> plot(M,RMSE_1,M,RMSE_2), grid on, xlabel('M'), ylabel('RMSE')
>> legend('RMSE-1 ряд Фурье','RMSE-2 полином')
