function z = local2_interp(tk,xk,t)
% ôóíêöèÿ, âîçâğàùàşùàÿ
% z - èíòåğïîëèğîâàííûå çíà÷åíèÿ
% Âõîäíûå ïåğåìåííûå:
% tk - âåêòîğ, ñîäåğæàùèé 
%      êîîğäèíàòû óçëîâ èíòåğïîëÿöèè
% xk - âåêòîğ, ñîäåğæàùèé çíà÷åíèÿ ÄÑ
% t – âåêòîğ, ñîäåğæàùèé 
%     êîîğäèíàòû óçëîâ ÂÑ, â êîòîğûõ
%     âû÷èñëÿşòñÿ èíòåğïîëèğîâàííûå çíà÷åíèÿ
%     «àíàëîãîâîãî»  ñèãíàëà
 
k=1;
z=zeros(1,length(t));
for i = 1:2:length(tk)-2
    % ôîğìèğîâàíèå ñèñòåìû óğàâíåíèé
    % îòíîñèòåëüíî êîıôôèöèåíòîâ 
    % èíòåğïîëÿöèîííîãî ïîëèíîìà
    A = [tk(i)^2 tk(i) 1 
         tk(i+1)^2 tk(i+1) 1
         tk(i+2)^2 tk(i+2) 1];
    B = [xk(i); xk(i+1); xk(i+2)];
    p(:,i) = A\B; % ğåøàåì ñèñòåìó óğàâíåíèé, âû÷èñëÿåì
 % âû÷èñèëåíèå êîıôôèöèåíòîâ àïïğîêñèìèğóşùèõ ïîëèíîìîâ
    h=[];g=1;     
   while t(k)>=tk(i) && t(k)<=tk(i+2) && k<length(t)
        h(g)=k;
        k=k+1;  
        g=g+1;
   end 
    z(:,h) = polyval(p(:,i), t(h));
end
% âû÷èñëåíèå èíòåğïîëèğîâàííûõ çíà÷åíèé 
% «àíàëîãîâîãî» ñèãíàëà íà ïîñëåäíåì 
% èíòåğâàëå èíòåğïîëÿöèè
i = length(tk)-2;
    A = [tk(i)^2 tk(i) 1 
         tk(i+1)^2 tk(i+1) 1
         tk(i+2)^2 tk(i+2) 1];
    B = [xk(i); xk(i+1); xk(i+2)];
    p(:,i) = A\B; 
    z(:,h(end)+1:end) = polyval(p(:,i), t(h(end)+1:end));
 
end
